dotemacs.org
# -*- ispell-dictionary: "en_US"; -*-
#+TITLE: Emacs Config
#+STARTUP: show3levels
#+PROPERTY: header-args :comments link :tangle yes :mkdirp yes :results none :noweb yes

This file recreates the emacs configuration

* ~early-init.el~
:PROPERTIES:
:header-args: :tangle early-init.el
:END:
#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)

  (setq gc-cons-threshold most-positive-fixnum)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (* 16 1024 1024))))
#+end_src

* Package management
:PROPERTIES:
:header-args+: :tangle lib/package-manager.el
:END:

#+begin_src emacs-lisp
  ;; (provide 'package-manager)

  ;; (require 'package)
  ;; (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  ;; (package-initialize)

  (provide 'package-manager)

  (defvar elpaca-installer-version 0.8)

  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))

  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (call-process "git" nil buffer t "clone"
                                          (plist-get order :repo) repo)))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  (elpaca elpaca-use-package
    (elpaca-use-package-mode))

  (use-package org
    :defer
    :ensure `(org
              :remotes ("tecosaur"
                        :repo "https://code.tecosaur.net/tec/org-mode.git"
                        :branch "dev")
              :files (:defaults ("etc/styles/" "etc/styles/*" "doc/*.texi"))
              :build t
              :pre-build
              (progn
                (with-temp-file "org-version.el"
                  (require 'lisp-mnt)
                  (let ((version
                         (with-temp-buffer
                           (insert-file-contents "lisp/org.el")
                           (lm-header "version")))
                        (git-version
                         (string-trim
                          (with-temp-buffer
                            (call-process "git" nil t nil "rev-parse" "--short" "HEAD")
                            (buffer-string)))))
                    (insert
                     (format "(defun org-release () \"The release version of Org.\" %S)\n" version)
                     (format "(defun org-git-version () \"The truncate git commit hash of Org mode.\" %S)\n" git-version)
                     "(provide 'org-version)\n")))
                (require 'elpaca-menu-org)
                (elpaca-menu-org--build))
              :pin nil))

  (elpaca-wait)

  ;; (defun +elpaca-unload-seq (e)
  ;;   "Unload seq before continuing the elpaca build, then continue to build the recipe E."
  ;;   (and (featurep 'seq) (unload-feature 'seq t))
  ;;   (elpaca--continue-build e))

  ;; (elpaca `(seq :build ,(append (butlast (if (file-exists-p (expand-file-name "seq" elpaca-builds-directory))
  ;;                                           elpaca--pre-built-steps
  ;;                                         elpaca-build-steps))
  ;;                              (list '+elpaca-unload-seq 'elpaca--activate-package))))


  (unless (equal system-type 'gnu/linux)
    (elpaca-no-symlink-mode))
#+end_src

* ~init.el~
:PROPERTIES:
:header-args+: :tangle init.el
:END:

#+begin_src emacs-lisp
  (mapc (lambda(string)
          (add-to-list 'load-path (locate-user-emacs-file string)))
        '("ext" "lib"))


  (require 'package-manager)


  (require 'rca-macros)
  (require 'rca-functions)
  (require 'rca-ui)
  (require 'rca-emacs)
  (require 'rca-org)
  (require 'rca-prog)
  (require 'rca-completion)
  (require 'rca-minibuffer)
  (require 'rca-project)
  (require 'rca-keyboard)
  (require 'rca-tex)
  (require 'rca-tools)
#+end_src

* Macros
:PROPERTIES:
:header-args+: :tangle lib/rca-macros.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-macros)

  (defmacro toggle-p (var)
    "Toggles a boolean variable"
    `(if (booleanp ,var) 
         (setq ,var (not ,var))))
#+end_src

* Custom functions
:PROPERTIES:
:header-args+: :tangle lib/rca-functions.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-functions)
#+end_src

** File manipulation

#+begin_src emacs-lisp
  (defun rc/file-find-config ()
    "Find config file interactively"
    (interactive)
    (find-file (locate-user-emacs-file
                (completing-read "Select config file: " emacs-config-files))))

  (defun rc/file-get-el (dir)
    "Get all elisp files from a directory"
    (directory-files dir nil "^[^.].*el$"))

  (defun rc/find-stow-file ()
    (interactive)
    (find-file
     (completing-read "Select config file: "
                      (directory-files-recursively
                       stow-files ".*" nil
                       (lambda (dir)
                         (not (string-match-p ".*git.*" dir)))))))

  (defun find-file-at-point-other-window ()
    (interactive)
    (let ((ffap-file-finder #'find-file-other-window))
      (find-file-at-point)))


  (defun rc/insert-wallpaper-file ()
    (interactive)
    (insert
     (file-name-sans-extension
      (file-name-nondirectory
       (completing-read "Select wallpaper: "
                        (directory-files-recursively
                         wallpaper-files ".*"))))))

  (defun rc/locate-or-create-directory (dir)
    "Search for a directory and create it if doesn't exists"
    (let ((dir_ (locate-user-emacs-file dir)))
       (when (not (file-directory-p dir_))
         (make-directory dir_)) dir_))

  (defun rc/config-insert-footer ()
    (let ((inhibit-message t))
      (goto-char (point-max))
      (insert "\n;; Local Variables:\n;; eval: (add-hook 'after-save-hook (lambda ()(org-babel-detangle)) nil t)\n;; End:")
      (save-buffer)))
#+end_src

** List manipulation

#+begin_src emacs-lisp
  (defun rc/list-append-str (string list &optional position)
    "Appends a string to each element of a list.
  If POSITION is nil appends to the beginning of each element."
    (mapcar (lambda (element)
              (if position
                  (concat element string)
                (concat string element)))
            list))

  (defun rc/list-merge-sublists (list)
    "Merge all the sublists in a list"
    (let (value)
      (dolist (elt list value)
        (setq value (append value elt)))))

  (defun rc/list-select-random (items)
    "Selects a random element from a list"
    (let* ((size (length items))
           (index (random size)))
      (nth index items)))
#+end_src

** Miscellaneous

#+begin_src emacs-lisp
  (defun rc/number-between (number bot top)
    "Determines if a number is within a range"
    (if (< number top)
        (if (> number bot)
            t nil)
      nil))

  (defun rc/time-is-day ()
    "Determines if the current time is considered day"
    (if (rc/number-between
         (nth 2 (decode-time (current-time)))
         8 18)
        t nil))

  (defun rc/truncate-lines-off ()
    "Command to set truncate-lines to t in mode hooks"
    (setq truncate-lines t))

  (defun rc/export-code-block-for-message (start end)
    "Copy current region and format it to a markdown codeblock"
    (interactive "r")
    (setq code-block (buffer-substring start end))
    (setq code-block-formatted (concat "```\n" code-block "```"))
    (deactivate-mark)
    (kill-new code-block-formatted))

  (defun line-contains? (string)
    (s-contains? string
                 (buffer-substring-no-properties
                  (line-beginning-position)
                  (line-end-position))))

  (defun replace-regexp-in-line (regexp replacement)
    (replace-regexp regexp replacement nil
                    (line-beginning-position)
                    (line-end-position)))

  (defun current-line-empty-p ()
    "Return t if the current line is empty otherwise returns nil"
    (save-excursion
      (beginning-of-line)
      (looking-at-p "[[:blank:]]*$")))

  (defun rc/wrap-in-question-marks ()
    (interactive)
    (let ((inicio (region-beginning))
          (fin (region-end)))
      (save-excursion
        (goto-char inicio)
        (insert "¿")
        (goto-char (+ fin 1))
        (when (eq (char-before) ?.) 
          (delete-char -1))
        (insert "?"))))

  (defun rc/org-update-idea ()
    "Adds a timestamp at the end of the current subtree."
    (interactive)
    (org-mark-subtree)
    (exchange-point-and-mark)
    (deactivate-mark)
    (previous-line)
    (open-line 1)
    (newline)
    (insert "UPDATE ")
    (org-insert-timestamp (current-time) t t)
    (insert ": "))

  (defun +diary-schedule-class (start-month start-day end-month end-day year days-of-week)
    (and (diary-block start-month start-day year
                      end-month end-day year)
         (or (cl-some (lambda (p) (= p (calendar-day-of-week date)))
                      days-of-week))))
#+end_src

