dotemacs.org
* Emacs module
:PROPERTIES:
:header-args+: :tangle lib/rca-emacs.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-emacs)

  (use-package emacs
    :ensure nil
    :bind (("C-x C-k C-x C-k" . kill-emacs)
           ("C-x B" . ibuffer)
           ("M-z" . zap-up-to-char)
           ("C-z" . nil)
           ("C-x C-r" . nil)
           ("C-x r v" . view-register)
           ("C-z C-j" . rc/file-find-config)
           ("C-z j" . rc/find-stow-file)
           ("C-x C-z" . nil)
           ("C-x t h" . tab-bar-mode)
           ("M-o" . other-window)
           ("C-c P" . find-file-at-point)
           ("C-x K" . (lambda () (interactive) (kill-buffer (current-buffer))))
           ("C-x C-c" . nil)
           ("C-h h" . nil)
           ("M-`" . nil)
           ("<insert>" . nil)
           ("<menu>" . nil))

    :preface
    (setq history-excluded-filetypes '(".*gz" ".*pdf" "bookmarks" "recentf"
      			             "init.el" ".*gitignore" "early-init.el"
      			             ".*log" ".*png" ".*jpg" ".*mp4" ".*gif"
      			             ".*agenda/.*" ".*mod/.*" ".*lib/.*" ".*ext/.*" ".*_db"))
    (setq temporal-directory
          (locate-user-emacs-file "temporal/"))
    (setq snippets-directory
          (locate-user-emacs-file "snippets/"))
    (setq backup-directory
          (rc/locate-or-create-directory  "saves/"))
    (setq undo-history-directory
          (rc/locate-or-create-directory  "undohist/"))
    (setq recentf-file
          (locate-user-emacs-file  "recentf"))
    (setq emacs-config-files-dirs
          '("" "lib/"))
    (setq stow-files
          (concat (getenv "HOME") "/dotfiles/"))
    (put 'eval 'safe-local-variable #'booleanp)
    :custom
    ;; (initial-buffer-choice t)
    (recentf-save-file recentf-file)
    (initial-scratch-message nil)
    (inhibit-initial-startup-message t)
    (ring-bell-function 'ignore)
    (dired-listing-switches "-alh")
    (column-number-mode t)
    (blink-cursor-mode nil)
    (help-window-select t)
    (use-dialog-box nil)
    (auto-save-default nil)
    (auto-save-interval 200)
    (auto-save-timeout 20)
    (history-length 25)
    (auto-save-list-file-prefix nil)
    (backup-directory-alist `(("." . ,backup-directory)))
    (recentf-exclude history-excluded-filetypes)
    (x-select-enable-clipboard t)
    (read-file-name-completion-ignore-case t)
    (async-shell-command-buffer 'confirm-kill-process)
    (server-client-instructions nil)
    (savehist-additional-variables (list 'register-alist))
    (register-use-preview t)
    :config
    (setq emacs-config-files
          (rc/list-merge-sublists
           (mapcar (lambda (dir)
                     (rc/list-append-str
                      dir (rc/file-get-el
                           (concat user-emacs-directory dir))))
                   emacs-config-files-dirs)))
    (recentf-mode 1)
    (savehist-mode 1)
    (global-auto-revert-mode 1)
    (defalias 'yes-or-no-p 'y-or-n-p)
    (add-hook 'prog-mode-hook 'display-line-numbers-mode)
    (add-hook 'shell-mode-hook 'rc/truncate-lines-off)
    (setq-default custom-file
                  (expand-file-name "custom.el" user-emacs-directory))
    (when (file-exists-p custom-file)
      (load custom-file))
    (when (not (file-exists-p temporal-directory))
      (make-directory temporal-directory))

    ;; Greentext mode
    (setq greentext-font-lock
          '(("^>.*" . 'success)))

    (define-derived-mode greentext-mode text-mode "🍀"
      "Major mode for display faces in greentext stories. Derived from `text-mode'."
      (setq font-lock-defaults '(greentext-font-lock))
      (olivetti-mode))

    ;; (add-to-list 'default-frame-alist '(height . 37))
    )

  (use-package calendar
    :ensure nil
    :bind (("<f6> c" . calendar))
    :mode ("diary" . diary-mode)
    :custom
    (diary-file "~/.sync/org_files/agenda/diary")
    (calendar-latitude -12.0)
    (calendar-longitude -77.1)
    (calendar-mark-diary-entries-flag t)
    (calendar-mark-holidays-flag t)
    (holiday-bahai-holidays nil)
    (holiday-bahai-holidays nil)
    (holiday-hebrew-holidays nil)
    (holiday-islamic-holidays nil))

#+end_src

* User interface
:PROPERTIES:
:header-args+: :tangle lib/rca-ui.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-ui)
#+end_src

** User interface general options

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :init
    ;; (set-face-attribute 'default nil :family "Iosevka Comfy" :height 130)
    ;; (set-face-attribute 'fixed-pitch nil :family "Iosevka Comfy")
    ;; (set-face-attribute 'variable-pitch nil :family "Iosevka Comfy Motion")
    (set-face-attribute 'default nil :family "Aporetic Sans Mono" :height 130)
    (set-face-attribute 'fixed-pitch nil :family "Aporetic Sans Mono")
    (set-face-attribute 'variable-pitch nil :family "Aporetic Serif Mono")
    (set-fontset-font t 'emoji (font-spec :family "Apple Color Emoji") nil 'prepend)
    (set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend)
    :custom
    (frame-resize-pixelwise t)
    (modus-themes-italic-constructs t)
    :config
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (setq-default fill-column 80)
    (setq-default indent-tabs-mode nil)
    (setq-default display-line-numbers-width 3)
    (setq-default display-line-numbers-grow-only t)
    (setq tab-bar-format '(tab-bar-format-history
                           tab-bar-format-tabs-groups
                           tab-bar-separator
                           tab-bar-format-add-tab
                           tab-bar-format-align-right
                           tab-bar-format-global)))
#+end_src

** Buffer display options

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :config
    (defun org-babel-detangle-no-buffer-pop-up (orig-fun &rest args)
      (save-excursion
        (let ((display-buffer-alist
               '((".*" (display-buffer-no-window) (allow-no-window . t)))))
          (apply orig-fun args))))
    (advice-add 'org-babel-detangle :around #'org-babel-detangle-no-buffer-pop-up)
    (setq display-buffer-alist
          '(
            ((derived-mode . shell-mode)
             (display-buffer-reuse-mode-window
              display-buffer-below-selected)
             (window-height . 12)
             (dedicated . t)
             (window-parameters . ((no-other-window . t)
    			         (mode-line-format . none))))
            ("^\\*\\(Help\\|Info\\|Man\\)"
             (display-buffer-in-side-window)
             (side . right)
             (slot . 0)
             (window-width . 0.40))
            ("\\*\\(Output\\|Register Preview\\).*"
             (display-buffer-reuse-mode-window
              display-buffer-at-bottom)
             (window-height . 10)
             (window-parameters . ((mode-line-format . none))))
            ("\\*\\(Agenda Commands\\|Org Agenda\\|Org Select\\).*"
             (display-buffer-reuse-mode-window
              display-buffer-at-bottom)
             (window-parameters . ((mode-line-format . none))))
            ("\\*compilation\\*"
             (display-buffer-reuse-mode-window
              display-buffer-below-selected)
             (window-height . 12)
             (dedicated . t))
            ("\\*\\(Python\\|vterm\\)\\*"
             (display-buffer-reuse-mode-window
              display-buffer-below-selected)
             (window-height . 20)
             (dedicated . t))
            ("\\*undo-tree\\*"
             (display-buffer-in-side-window)
             (side . right)
             (dedicated . t)
             (window-width . 0.25)))))
#+end_src

** User interface variables

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :init
    (defcustom wallpaper-files
      (concat (getenv "HOME") "/.sync/pix/wallpaper/")
      "Folder where wallpaper files are stored."
      :type 'directory))
#+end_src

** Diminish

#+begin_src emacs-lisp
  (use-package diminish
    :ensure t
    :config
    (diminish 'which-key-mode nil)
    (diminish 'eldoc-mode nil))
#+end_src

** Themes

#+begin_src emacs-lisp
  (use-package ef-themes
    :ensure t
    :init
    (setq themes
          '((parsee ef-reverie ef-elea-dark)
            (yuuma ef-tritanopia-light ef-rosa)
            (nazrin2 ef-light ef-owl)
            (youmu ef-elea-light ef-elea-dark)
            (satori ef-trio-light ef-trio-dark)))
    (setq theme-character 'youmu)
    :config
    (setq ef-themes-mixed-fonts t)
    (setq ef-themes-headings
          '((0 . (1.6))
            (1 . (1.5))
            (2 . (1.3))
            (agenda-date . (1.3))
            (agenda-structure . (1.8))
            (t . (1.1)))))
#+end_src

** Circadian

#+begin_src emacs-lisp
  (use-package circadian
    :ensure t
    :after (:all ef-themes emacs calendar)
    :hook
    (server-after-make-frame . (lambda () (enable-theme (car custom-enabled-themes))))
    :config
    (let* ((theme-colors (cdr (assoc theme-character themes)))
           (sunrise (car theme-colors))
           (sunset (cdr theme-colors)))
      (setq circadian-themes `((:sunrise . ,sunrise)
                               (:sunset . ,sunset))))
    (circadian-setup))
#+end_src

** Olivetti

#+begin_src emacs-lisp
  (use-package olivetti
    :ensure t
    :hook (Info-mode . olivetti-mode))
#+end_src

** Spacious-Padding

#+begin_src emacs-lisp
  (use-package spacious-padding
    :ensure t
    :config
    (setq-default header-line-format
                  '("%e" mode-line-front-space
                    (:propertize
                     display (min-width (6.0)))
                    "%b" mode-line-end-spaces))

    (setq-default mode-line-format
                  '("%e" mode-line-front-space
                    (:propertize
                     ("" mode-line-mule-info mode-line-client mode-line-modified mode-line-remote
                      mode-line-window-dedicated)
                     display (min-width (6.0)))
                    mode-line-frame-identification "   "
                    mode-line-position (project-mode-line project-mode-line-format)
                    (vc-mode vc-mode) "  " mode-line-modes mode-line-misc-info mode-line-end-spaces))

    (set-face-attribute 'header-line-active nil :inherit 'mode-line-active)
    
    (setq spacious-padding-widths
          '( :internal-border-width 6
             :header-line-width 3
             :mode-line-width 3
             :tab-width 3
             :right-divider-width 20
             :scroll-bar-width 4
             :fringe-width 4))
    ;; (setq spacious-padding-subtle-mode-line
    ;;       `( :mode-line-active 'default
    ;;          :mode-line-inactive vertical-border))

    (spacious-padding-mode 1)

    ;; Set a key binding if you need to toggle spacious padding.
    (define-key global-map (kbd "<f8>") #'spacious-padding-mode))
#+end_src

