dotemacs.org
** FORTRAN


#+begin_src emacs-lisp
  (use-package fortran
    :ensure nil
    :config
    (add-hook 'f90-mode-hook
              (lambda ()
                (set (make-local-variable 'compile-command)
                     (format "gfortran %s && ./a.out" (file-name-nondirectory buffer-file-name))))))
#+end_src

** Gnu plot

#+begin_src emacs-lisp
  (use-package gnuplot
    :ensure t
    :defer t)
#+end_src

** LUA

#+begin_src emacs-lisp
  (use-package lua-mode
    :ensure t
    :defer t)

  (use-package lua-ts-mode
    :ensure nil
    ;; :defer t
    :mode "\\.lua\\'"
    :bind (:map lua-ts-mode-map ("C-c C-c" . lua-send-buffer)))
#+end_src

** Julia

#+begin_src emacs-lisp
  (use-package julia-mode
    :ensure t
    :defer t
    :bind (:map julia-mode-map ("`" . julia-insert-unicode-symbol))
    :init  
    (defvar julia-unicode-symbols-alist
      '((?a . "α") (?b . "β")
        (?\C-a . "ₐ")
        (?0 . "₀")
        (?1 . "₁")
        (?2 . "₂")
        (?3 . "₃")
        (?4 . "₄"))
      "List of unicode symbols to be inserted in julia-mode")

    (defun julia-insert-unicode-symbol ()
      (interactive)
      (let* ((char (read-char "Insert symbol: "))
             (entry (assoc char julia-unicode-symbols-alist))
             (symbol (cdr entry)))
        (if (equal nil entry)
            (error "The symbol is not mapped")
          (insert symbol)))))

  (use-package julia-snail
    :ensure t
    :defer t
    :hook (julia-mode . julia-snail-mode))
#+end_src

** Python

#+begin_src emacs-lisp
  (use-package python-mode
    :ensure nil
    :defer t
    :bind (:map python-mode-map
                ("C-c v" . python-set-venv))
    :init
    (defun python-set-venv (interpreter)
      (interactive "fPython interpreter:")
      (setq python-interpreter interpreter
            python-shell-interpreter interpreter))
    :config
    (setq-default python-eldoc-get-doc nil))
#+end_src

** Markdown

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t)
#+end_src

** Java

#+begin_src emacs-lisp
  (use-package eglot-java
    :ensure t
    :defer t
    :config
    (setq eglot-java-eclipse-jdt-args `("-Xmx1G" "--add-modules=ALL-SYSTEM" "--add-opens"
                                        "java.base/java.util=ALL-UNNAMED" "--add-opens"
                                        "java.base/java.lang=ALL-UNNAMED"
                                        ,(concat "-javaagent:" (expand-file-name user-emacs-directory) "share/eclipse.jdt.ls/plugins/lombok.jar")
                                        ,(concat "-Xbootclasspath/a:" (expand-file-name user-emacs-directory) "share/eclips.jdtls/plugins/lombok.jar"))))

  (use-package java
    :ensure nil
    :defer t
    :config
    (defun rc/spring-run ()
      "Runs current spring boot project in an async shell window"
      (interactive)
      (let ((default-directory (project-root (project-current t))))
        (async-shell-command "mvn spring-boot:run" "\*Spring Boot\*")))

    (defun rc/spring-shell ()
      "Opens the current spring shell"
      (interactive)
      (if (get-buffer "\*Spring Boot\*")
          (display-buffer "\*Spring Boot\*")
        (message "No spring boot proccess running. Try spring-run."))))
#+end_src

** HTML

#+begin_src emacs-lisp
  (use-package mhtml-mode
    :ensure nil
    :defer t
    :preface
    (defun sgml-delete-tagged-text ()
      "Delete text between the tags that contain the current point"
      (interactive)
      (let ((b (point)))
        (sgml-skip-tag-backward 1)
        (when (not (eq b (point)))
          ;; moved somewhere, should be at front of a tag now
          (save-excursion 
            (forward-sexp 1)
            (setq b (point)))
          (sgml-skip-tag-forward 1)
          (backward-sexp 1)
          (delete-region b (point))
          (meow-insert))))
    :bind (("C-c C-i" . sgml-delete-tagged-text)))
    ;; :config
    ;; (define-key mhtml-mode-map (kbd "C-c C-i") 'sgml-delete-tagged-text))
#+end_src

** Tree-sitter

#+begin_src emacs-lisp
  (use-package toml-ts-mode
    :ensure nil
    :mode "\\.toml\\'")
#+end_src

** ~eglot~
#+begin_src emacs-lisp
  (use-package eglot
    :ensure nil
    :defer t
    :custom
    (eldoc-echo-area-use-multiline-p nil)
    ;; (eglot-ignored-server-capabilities '(:hoverProvider))
    :config
    (defun eglot-open-link ()
      "Open markdown link at point in the `eldoc-doc-buffer'."
      (interactive)
      (let ((url (get-text-property (point) 'help-echo)))
        (if url
            (browse-url-xdg-open url)
          (message "No URL found at point")))))
#+end_src

* Completion
:PROPERTIES:
:header-args+: :tangle lib/rca-completion.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-completion)
#+end_src

** Completion general options

#+begin_src emacs-lisp
  (use-package emacs
    :init
    (setq tab-always-indent 'complete)
    (setq text-mode-ispell-word-completion nil))
#+end_src

** ~yasnippet~

#+begin_src emacs-lisp :tangle no
  (use-package yasnippet
    :ensure t
    :diminish yas-minor-mode
    :custom
    (yas-snippet-dirs `(,(locate-user-emacs-file "snippets")))
    :config
    (when (not (file-exists-p  snippets-directory))
      (make-directory snippets-directory))
    (yas-global-mode 1))
#+end_src

** ~tempel~

#+begin_src emacs-lisp
  ;; Configure Tempel
  (use-package tempel
    :ensure t
    ;; Require trigger prefix before template name when completing.
    ;; :custom
    ;; (tempel-trigger-prefix "<")

    :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
           ("M-*" . tempel-insert))

    :init

    ;; Setup completion at point
    (defun tempel-setup-capf ()
      ;; Add the Tempel Capf to `completion-at-point-functions'.
      ;; `tempel-expand' only triggers on exact matches. Alternatively use
      ;; `tempel-complete' if you want to see all matches, but then you
      ;; should also configure `tempel-trigger-prefix', such that Tempel
      ;; does not trigger too often when you don't expect it. NOTE: We add
      ;; `tempel-expand' *before* the main programming mode Capf, such
      ;; that it will be tried first.
      (setq-local completion-at-point-functions
                  (cons #'tempel-expand
                        completion-at-point-functions)))

    (add-hook 'conf-mode-hook 'tempel-setup-capf)
    (add-hook 'prog-mode-hook 'tempel-setup-capf)
    (add-hook 'text-mode-hook 'tempel-setup-capf)

    ;; Optionally make the Tempel templates available to Abbrev,
    ;; either locally or globally. `expand-abbrev' is bound to C-x '.
    ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
    ;; (global-tempel-abbrev-mode)
  )

  ;; Optional: Add tempel-collection.
  ;; The package is young and doesn't have comprehensive coverage.
  (use-package tempel-collection
    :ensure t)
#+end_src

** ~corfu~

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :bind
    (("C-<tab>" . completion-at-point)
     :map corfu-map
     ("S-SPC" . corfu-insert-separator)
     :map corfu-popupinfo-map
     ("M-n" . corfu-popupinfo-scroll-up)
     ("M-p" . corfu-popupinfo-scroll-down))
    :init
    (global-corfu-mode)
    :custom
    (corfu-min-width 70)
    (corfu-max-width 70)
    (corfu-popupinfo-mode 1)
    (corfu-popupinfo-delay '(1.0 . 1.2))
    (corfu-on-exact-match nil)
    ;; (corfu-auto-prefix 4)
    (corfu-separator ?\s)
    (corfu-auto t)
    (corfu-cycle t)
    (corfu-quit-no-match 'separator))
#+end_src

** Icons

#+begin_src emacs-lisp
  (use-package kind-icon
    :ensure t
    :after corfu
    :custom
    (kind-icon-use-icons nil)
    ;; (kind-icon-blend-background t)
    ;; (kind-icon-default-face 'corfu-default) ; only needed with blend-background
    :config
    (add-hook 'after-enable-theme-hook  #'kind-icon-reset-cache)
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

** ~cape~

#+begin_src emacs-lisp
  (use-package cape
    :ensure t
    :init
    ;; Make dabbrev use the correct case
    (defun my-cape--dabbrev-fix-expansion (expansion)
      "Return the downcased EXPANSION.
   Removes trailing non-alphanumeric characters if present."
      (let ((downcased (downcase expansion)))
        (substring downcased 0 (string-match-p "[^[:alnum:]]+$" downcased))))
    
    (defun my-cape--dabbrev-list (input)
      "Find all dabbrev expansions for INPUT. "
      (cape--silent
        ;; Don't search all buffers. Only those with the same major-mode.
        (let ((dabbrev-check-other-buffers t)
              (dabbrev-check-all-buffers nil))
          (dabbrev--reset-global-variables))
        (cons
         (apply-partially #'string-prefix-p input)
         (cl-loop for w in (mapcar #'my-cape--dabbrev-fix-expansion
                                   (dabbrev--find-all-expansions input t))
                  if (>= (length w) cape-dabbrev-min-length) collect
                  (cape--case-replace t input w)))))

    (advice-add 'cape--dabbrev-list :override #'my-cape--dabbrev-list)

    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-keyword)
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-elisp-block))
#+end_src

** ~dabbrev~

#+begin_src emacs-lisp
  (use-package dabbrev
    :bind (("C-." . dabbrev-expand)
           ("C-:" . dabbrev-completion))
    :config
    (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
    ;; Since 29.1, use `dabbrev-ignored-buffer-regexps' on older.
    (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode))
#+end_src

** ~smartparens~

#+begin_src emacs-lisp
  (use-package smartparens
    :ensure t
    :hook (prog-mode org-mode)
    :config
    (require 'smartparens-config))
#+end_src

** ~flyspell~

#+begin_src emacs-lisp :tangle no
    (use-package flyspell
      :bind (:map flyspell-mode-map
                  ("C-." . nil))
      :config
      (setq ispell-program-name "aspell"
    	ispell-personal-dictionary "~/.sync/dict/aspell_es"
    	ispell-dictionary "es")
      :hook (org-mode . flyspell-mode))
#+end_src

** ~jinx~

#+begin_src emacs-lisp
  (use-package jinx
    :ensure t
    :hook (org-mode . jinx-mode)
    :bind (("M-$" . jinx-correct)
           ("C-M-$" . jinx-languages))
    :config
    (setq jinx-languages "es en_US"))
#+end_src

** ~vundo~

#+begin_src emacs-lisp
  (use-package vundo
    :ensure t
    :bind ("C-x u" . vundo))
#+end_src

** ~eldoc~

#+begin_src emacs-lisp
  (use-package eldoc-box
    :ensure t
    :custom
    (eldoc-box-max-pixel-width 550)
    (eldoc-box-max-pixel-height 400)
    :bind (("M-ñ" . eldoc-box-help-at-point)
           ("M-n" . eldoc-box-scroll-up)
           ("M-p" . eldoc-box-scroll-down)))
#+end_src

* Minibuffer
:PROPERTIES:
:header-args+: :tangle lib/rca-minibuffer.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-minibuffer)
#+end_src

** ~vertico~

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :init
    (vertico-mode)
    :custom
    (vertico-cicle t)
    (vertico-count 12))
#+end_src

** ~vertico-posframe~

#+begin_src emacs-lisp
  (use-package vertico-posframe
    :ensure t
    :config
    (setq vertico-posframe-poshandler 'posframe-poshandler-frame-bottom-center)
    ;; (setq vertico-posframe-parameters
    ;;       '((left-fringe . 8)
    ;;         (right-fringe . 8)))
    (setq vertico-posframe-width 300)
    (vertico-posframe-mode 1))
#+end_src

** ~orderless~

#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles
                                            basic
                                            partial-completion)))))
#+end_src

** ~marginalia~

#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :config
    (marginalia-mode))
#+end_src

** ~consult~

#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :bind (("C-x C-b" . consult-buffer)
           ("C-x R" . consult-recent-file)
           ("C-x r i" . consult-register)
           ("C-x r b" . consult-bookmark)
           ("M-s f" . consult-recent-file)
           ("M-s b" . consult-bookmark)
           ("M-s l" . consult-line)
           :map org-mode-map
           ("M-s s" . consult-org-heading))
    :config
    (consult-customize consult-recent-file :preview-key nil)
    (consult-customize consult-bookmark :preview-key nil))
#+end_src

* Project management
:PROPERTIES:
:header-args+: :tangle lib/rca-project.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-project)
#+end_src

** ~transient~

#+begin_src emacs-lisp
  (use-package transient
    :ensure t)
#+end_src

** ~llama~

#+begin_src emacs-lisp
  (use-package llama
    :ensure t)
#+end_src

** ~magit~

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :requires transient
    :defer 1)
#+end_src

** ~skeletor~

#+begin_src emacs-lisp
  (use-package skeletor
    :ensure t
    :custom
    (skeletor-project-directory "~/Files/workspace/projects/")
    :config
    (skeletor-define-template "latex-article"
      :title "LaTeX Article"
      :no-license? t)
    (skeletor-define-template "LaTeX-APA7"
      :title "LaTeX APA 7th Article"
      :no-license? t)
    (skeletor-define-template "latex-beamer"
      :title "LaTeX Beamer"
      :no-license? t))
#+end_src

* Input
:PROPERTIES:
:header-args+: :tangle lib/rca-keyboard.el
:END:

#+begin_src emacs-lisp
  (provide 'rca-keyboard)
#+end_src

